Repository: JuanManuelRomeroGarcia/Base-Flask
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Control Panel
es: Panel de Control

source: Role
es: Rol Usuario

source: User
es: Usuario

source: Name Role
es: Nombre Rol.

source: Username
es: Usuario

source: Password
es: Contraseña

source: Email
es: Correo electrónico

source: Email verified
es: Verificacion de Email

source: You have to be admin
es: Tienes que ser administrador

source: You do not have permission to create users
es: No tienes permiso para crear usuarios.

source: You do not have permission to edit users
es: No tienes permiso para editar usuarios.

source: Name
es: Nombre

source: Description
es: Descripcion

source: name
es: Nombre

source: username
es: Usuario

source: password
es: Contraseña

source: email
es: Correo electrónico

source: role
es: Rol Usuario

source: email_verified
es: Verificacion de Email

source: Confirm Password
es: Confirmar Contraseña

source: Confirm password
es: Confirmar Contraseña

source: Register
es: Registro

source: Remember me
es: Recuérdame

source: Login
es: Iniciar sesión

source: Request Password Reset
es: Resetear Contraseña

source: Repeat Password
es: Repetir Contraseña

source: Current Password
es: Contraseña actual

source: New Password
es: Nueva contraseña

source: Passwords must match
es: Las contraseñas deben coincidir

source: Confirm New Password
es: Confirmar Contraseña

source: Change Password
es: Cambio de contraseña

source: Your email has not been verified. Please verify your email before login.
es: Tu email no se ha verificado. Por favor verifique su correo electrónico antes de iniciar sesión

source: Welcome %(username)s
es: Bienvenido %(username)s.

source: Username or password incorrect
es: Usuario o contraseña incorrectos

source: Login App
es: Iniciar sesión

source: You have logged out, we hope to see you soon.
es: Has cerrado sesión, esperamos verte pronto.

source: Invalid username. Only alphanumeric characters and underscores are allowed.
es: Nombre de usuario no válido. Sólo se utilizan caracteres alfanuméricos y guiones bajos permitido.

source: Register from App-Manuals
es: Regristro de App

source: The username is already taken. Please choose a different username.
es: El correo electrónico ya está registrado. Utilice otro correo electrónico.

source: The email is already registered. Please use another email.
es: El correo electrónico ya está registrado. Utilice otro correo electrónico.

source: Congratulations, you are now a registered user!
es: ¡Felicidades, ahora eres un usuario registrado!

source: An unexpected error occurred. Please try again.
es: Se produjo un error inesperado. Inténtelo de nuevo"

source: Register from App
es: Registro de Alicacion

source: Your password has been reset.
es: Tu contraseña ha sido restablecida

source: Check your email for instructions to reset your password
es: Revise su correo electrónico para obtener instrucciones para restablecer su contraseña

source: The new passwords do not match.
es: Las contraseñas no coinciden

source: Your password has been successfully updated.
es: Tu contraseña ha sido restablecida

source: The current password is incorrect.
es: Usuario o contraseña incorrectos

source: Request verification Reset
es: Solicitar verificación

source: Your email has been successfully verified! Now you can log in.
es: Tu email no se ha verificado. Por favor verifique su correo electrónico antes de iniciar sesión

source: Invalid verification token. Please request verification again.
es: Token de verificación no válido. Solicite la verificación nuevamente.

source: New confirmation email was sent. Please verify your email.
es: Tu email no se ha verificado. Por favor verifique su correo electrónico antes de iniciar sesión

source: A new confirmation email cannot be sent. Your email is now verified.
es: No se puede enviar un nuevo correo electrónico de confirmación. Su correo electrónico ya está verificado.

source: Reset Your Password
es: Resetear Contraseña

source: Email Verification
es: Verificacion de Email

source: You do not have permission to access
es: No tienes permiso para ver este recurso.

source: Home
es: Inicio

source: Language changed successfully.
es: Cambio de idioma corecto.

source: Invalid language selection.
es: Selección de idioma inválida.

source: Temporary email not allowed
es: Correo electrónico temporal no permitido

source: Welcome to
es: Bienvenido

source: Change password
es: Cambio de contraseña

source: Logout
es: Cerrar sesión

source: You do not have an account? Sign up here
es: ¿No tienes una cuenta? Regístrate aquí

source: Welcome
es: Bienvenido

source: Introduction to the Flask Base Project
es: Introducción al Proyecto Flask Base

source: Welcome to our Flask Base Project, a foundational framework for future web developments using Flask. This project is not only structured and tested for efficiency and security, but also incorporates key features to meet the needs of both developers and end-users.
es: Bienvenido a nuestro proyecto Flask Base, un marco fundamental para el futuro desarrollo web utilizando Flask. Este proyecto no sólo está estructurado y Probado en cuanto a eficiencia y seguridad, pero también incorpora características clave para Satisfacer las necesidades tanto de los desarrolladores como de los usuarios finales.

source: This project supports multilingual functionality, offering translations in English and Spanish using Babel.
es: Este proyecto admite funcionalidad multilingüe y ofrece traduccionesen inglés y español usando Babel.

source: Main Features:
es: Principales características:

source: Automated Database with Admin User:
es: Base de datos automatizada con usuario administrador:

source: The project includes an automatically configured database upon installation. It is designed for efficiency and security, with a pre-set admin user, simplifying system management and maintenance.
es: El proyecto incluye una base de datos configurada automáticamente al instalación. Está diseñado para la eficiencia y la seguridad, con un usuario administrador preestablecido, simplificando la gestión y mantenimiento del sistema.

source: Advanced Administrative Panel:
es: Panel administrativo avanzado:

source: The intuitive and comprehensive admin panel allows for efficient user, role, and system settings management, providing full control over the project’s operation and security.
es: El panel de administración intuitivo y completo permite un usuario eficiente, Administración de funciones y configuración del sistema, proporcionando control total sobre operación y seguridad del proyecto.

source: Content Security Policy (CSP):
es: Política de seguridad de contenidos (CSP):

source: Security is a priority. We’ve implemented CSP policies to protect against content injection attacks like Cross-Site Scripting (XSS) and other injection-based attacks.
es: La seguridad es una prioridad. Hemos implementado políticas de CSP para protegernos contra Ataques de inyección de contenido como Cross-Site Scripting (XSS) y otros ataques basados ​​en inyecciones.

source: Email Configuration and Password Recovery:
es: Configuración de correo electrónico y recuperación de contraseña:

source: We understand the importance of communication and security in user management. The project includes an email configuration system and a secure password recovery feature for users.
es: Entendemos la importancia de la comunicación y la seguridad en el usuario. El proyecto incluye un sistema de configuración de correo electrónico y una función segura de recuperación de contraseña para los usuarios.

source: User and Role Management Model:
es: Modelo de Gestión de Usuarios y Roles:

source: The project offers a comprehensive user and role management model, providing different access levels and functionalities, essential for complex permission hierarchies and user management.
es: El proyecto ofrece un modelo integral de gestión de usuarios y roles, proporcionando diferentes niveles de acceso y funcionalidades, esenciales para Jerarquías de permisos complejas y gestión de usuarios.

source: Advanced Logging System:
es: Sistema de registro avanzado:

source: An advanced logging system records all relevant activities, aiding in problem identification and resolution, and adding an extra layer of security by monitoring system and user behavior.
es: Un sistema de registro avanzado registra todas las actividades relevantes, ayudando en Identificación y resolución de problemas, y adición de una capa adicional de seguridad mediante el seguimiento del sistema y el comportamiento del usuario.

source: This Flask Base Project represents a comprehensive and adaptable solution, ideal for developers seeking a reliable foundation for their future web projects. Its combination of automation, security, and advanced features ensures that developers can focus on customization and unique feature development, knowing they have a solid and tested base.
es: Este proyecto Flask Base representa una solución integral y adaptable Solución ideal para desarrolladores que buscan una base confiable para su proyectos web del futuro. Su combinación de automatización, seguridad y Las funciones avanzadas garantizan que los desarrolladores puedan centrarse en la personalización y desarrollo de características únicas, sabiendo que tienen una base sólida y probada.

source: Back
es: Volver

source: My account
es: Mi cuenta

source: Base Flask user login
es: Inicio de sesion de Flask_Base

source: Do you need to resend the confirmation email?
es: ¿Necesitas reenviar el correo electrónico de confirmación?

source: Forgot your password?
es: ¿Olvidaste tu contraseña?

source: Click to Reset
es: Reenviar

source: Close
es: Cerrar

source: User Registration
es: Registro de usuario

source: Reset Password
es: Resetear Contraseña

source: Dear
es: Estimado/a

source: To reset your password,
es: Resetear Contraseña

source: click here
es: Reenviar

source: Alternatively, you can paste the following link into your browser's address bar:
es: Como alternativa, puedes pegar el siguiente enlace en el navegador Barra de dirección:

source: If you did not request a password reset, please disregard this message.
es: Si no solicitó un restablecimiento de contraseña, ignore este mensaje.

source: Sincerely,
es: Atentamente

source: To verify your email, please click on the following link:
es: Para verificar su correo electrónico, haga clic en el siguiente enlace:

source: Click here to verify your email
es: Por favor confirma tu correo electrónico

source: If you did not request this verification, please ignore this message.
es: Si no solicitó esta verificación, ignore este mensaje.

source: The page you are looking for does not exist.
es: La página que buscas no existe..

source: It appears that the page has moved. Please visit:
es: Parece que la página se ha movido. Visite:

source: New url
es: Nueva Url.

source: Go Back
es: Volver

source: Error 405 - Method Not Allowed
es: Error 405: método no permitido

source: The HTTP method used is not allowed for this URL.
es: El método HTTP utilizado no está permitido para esta URL"

source: Method:
es: Método:

source: Something went wrong.
es: Algo salió mal.

source: The server encountered an internal error and was unable to complete your request.
es: El servidor encontró un error interno y no pudo completar su solicitud.

source: Please contact the server administrator at
es: Por favor contacte al administrador del servidor en

source: to inform them of the time this error occurred and the actions you performed just before this error.
es: para informarles de la hora en que ocurrió este error y las acciones que usted realizado justo antes de este error"
